<?php
/**
 * Created by PhpStorm.
 * User: ylsc
 * Date: 16-8-8
 * Time: 下午6:18
 */

return [
    '100000000' => '',
    '100000001' => '该分类ID不存在',
    '100000002' => '创建分类失败',
    '100000003' => '创建分类成功',
    '100000004' => '分类修改成功',
    '100000005' => '分类修改失败',
    '100000006' => '不允许修改自己为自己的子类或归属于自己的子类',
    '100000007' => '分类删除成功',
    '100000008' => '分类删除失败,请先删除子分类',

    '200000001' => '新增标签成功',
    '200000002' => '新增标签失败',
    '200000003' => '修改标签成功',
    '200000004' => '修改标签失败',
    '200000005' => '删除标签成功',
    '200000006' => '删除标签失败',
    '200000007' => '标签已存在',
    '200000008' => '该标签ID不存在',

    '300000001' => '新增文章成功',
    '300000002' => '新增文章失败',
    '300000003' => '修改文章成功',
    '300000004' => '修改文章失败',
    '300000005' => '删除文章成功',
    '300000006' => '删除文章失败',
    '300000007' => '该文章ID不存在',
    '300000008' => '恢复文章成功',
    '300000009' => '恢复文章失败',

    '500000001' => 'seo设置保存成功',
    '500000002' => 'seo设置保存失败',
    '500000003' => '友链设置保存成功',
    '500000004' => '友链设置保存失败',
    '500000005' => '导航设置保存成功',
    '500000006' => '导航设置保存失败',

    '500000007' => '该ID不存在',
    '500000008' => '删除操作成功',
    '500000009' => '删除操作失败',

];